app/Controllers/Book.php

SELECT `book`.*, `category`.`cat_name`
FROM `book`
JOIN `category` ON `category`.`cat_id` = `book`.`category_id`
---
public function fetchBooks() {
    $bookModel = new BookModel();
    $categoryModel = new CategoryModel();

    $books = $bookModel->select('book.*, category.cat_name')
                      ->join('category', 'category.cat_id = book.category_id')
                      ->findAll();