app/Controllers/Borrowing.php

    public function fetchBorrowers() {
        $borrowerModel = new BorrowerModel();
        $bookModel = new BookModel();

        $borrowers = $borrowerModel->select('borrowing_record.*, book.title')
                                   ->join('book', 'book.book_id = borrowing_record.book_id')
                                   ->findAll();
---
SELECT `borrowing_record`.*, `book`.`title`
FROM `borrowing_record`
JOIN `book` ON `book`.`book_id` = `borrowing_record`.`book_id`